<?php
//    echo "Test Wordpress Theme <br>"."\n";

$card = [
    "Васильев" => [
        "Имя" => "Иван",
        "Фамилия" => "Васильев",
        "Год рождения" => "1996",
        "Зарплата" => "1500",
        "Должность" => "Программист",
        "Опыт" => "3,5",
    ],
    "Мищенко" => [
        "Имя" => "Артем",
        "Фамилия" => "Мищенко",
        "Год рождения" => " ",
        "Зарплата" => "300",
        "Должность" => "Стажер",
        "Опыт" => "0,5",
    ],
    "Герасимова"=> [
        "Имя" => "Анна",
        "Фамилия" => "Герасимова",
        "Год рождения" => " ",
        "Зарплата" => "800",
        "Должность" => "Бухгалтер",
        "Опыт" => "8",
    ],
    "Анзин" => [
        "Имя" => "Максим",
        "Фамилия" => "Анзин",
        "Год рождения" => " ",
        "Зарплата" => "4000",
        "Должность" => "Директор",
        "Опыт" => "5",
    ],
    "Фролова" => [
        "Имя" => "Ирина",
        "Фамилия" => "Фролова",
        "Год рождения" => " ",
        "Зарплата" => "300",
        "Должность" => "Дизайнер",
        "Опыт" => "3",
    ],
    "Стоянова" => [
        "Имя" => "Евдокия",
        "Фамилия" => "Стоянова",
        "Год рождения" => " ",
        "Зарплата" => "200",
        "Должность" => "Уборщица",
        "Опыт" => "3",
    ]
];
echo '<table cellpadding="5" cellspacing="0" border="1">';
foreach ($card as $key => $value) {

    echo '<tr>'/*. $key . "\n"*/;

    foreach ($value as $key_a => $value_a) {

        if($key_a["Зарплата"] > 1000 && $key_a['Опыт'] < 5 ){

            echo '<td>' ./* $key_a . " => " .*/

                $value_a . "\n" . '</td>';

        }
    }
    echo '</tr>';
}

echo '</table>';
